app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book = Book.find(params[:id])

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "kk"], ["body", "aa"], ["created_at", "2020-05-01 06:18:14.381481"], ["updated_at", "2020-05-01 06:18:14.381481"]]
---
  def create
    @book = Book.new(book_params)
    if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @book = Book.find(params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "pp22"], ["updated_at", "2020-05-01 13:03:17.380418"], ["id", 20]]
---
  def update
    book = Book.find(params[:id])
    if book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 20]]
---
  def destroy
    book = Book.find(params[:id])
    if book.destroy